{
  "title": "EML zu HTML Converter",
  "description": "Konvertieren EML email files zu HTML mit header extraction, attachment handling, und multi-anzeigen rendering",
  "placeholder": "Upload an EML file oder einfügen EML content hier ein...",
  "meta": {
    "title": "EML zu HTML Konverter - Online",
    "description": "EML-E-Mail-Dateien sofort in HTML konvertieren. Header analysieren, Anhänge extrahieren und E-Mail-Inhalte anzeigen. MIME- und RFC822-Unterstützung. Kostenlos."
  },
  "tagline": "Konvertieren EML email files zu HTML mit advanced parsing und multi-anzeigen rendering",
  "pageDescription": "Professioneller EML zu HTML converter mit MIME parsing, header extraction, attachment handling, und security sanitization. Konvertieren emails von Outlook, Thunderbird, Apple Mail, und other clients. Features include raw anzeigen, rendered HTML anzeigen, headers table, source anzeigen, und attachment extraction. Perfect für email migration, template analysis, forensics, und archiving. Supports quoted-printable, base64 encoding, multipart messages, inline images, und alle RFC822/2822 Standards.",
  "instructions": {
    "title": "So verwenden Sie EML zu HTML Converter",
    "steps": [
      {
        "title": "Upload oder einfügen Ihre EML file",
        "description": "Upload an .eml file von Ihre computer oder einfügen die EML content directly in den Eingabebereich ein. The Tool accepts standard RFC822/2822 email Format von jede email client."
      },
      {
        "title": "Wählen Ihre anzeigen mode",
        "description": "Auswählen von Raw Anzeigen (original EML), Rendered Anzeigen (HTML as it appears), Headers Anzeigen (structured metadata table), oder Source Anzeigen (extracted HTML-Code) zu analyze verschieden aspects of die email."
      },
      {
        "title": "Review extracted components",
        "description": "Examine email headers (From, To, Subject, Date), anzeigen die HTML oder plain text body, und zugreifen die attachments list mit metadata including file names, types, und sizes."
      },
      {
        "title": "Exportieren oder download results",
        "description": "Download die converted HTML as a standalone file, exportieren headers as JSON für programmatic verwenden, speichern attachments separately, oder kopieren die HTML source code zu clipboard."
      }
    ],
    "features": [
      "Multi-anzeigen rendering: Raw, Rendered, Headers, Source",
      "Complete MIME parsing mit RFC822/2822 support",
      "Automatisch encoding Erkennung und Konvertierung (UTF-8, ISO-8859-1, Windows-1252)",
      "Quoted-printable und Base64 decoding",
      "Multipart/alternative und multipart/mixed handling",
      "Inline image extraction mit CID Referenz Konvertierung",
      "Attachment listing mit download capability",
      "Email header parsing und JSON exportieren",
      "HTML sanitization für XSS protection",
      "JavaScript und event handler removal",
      "DKIM/SPF header highlighting",
      "Tracking pixel Erkennung",
      "Link analysis und extraction",
      "Email client Erkennung",
      "Template recognition (MailChimp, SendGrid, etc.)",
      "Dark mode HTML Konvertierung",
      "Responsive mobile/desktop preview",
      "Batch processing für multiple EML files",
      "CSS inlining für email compatibility",
      "No server upload - 100% client-side processing"
    ],
    "useCases": [
      "Email migration zwischen platforms und Systeme",
      "Email template analysis und reverse engineering",
      "Email forensics und header troubleshooting",
      "Legal Konformität und email archiving",
      "Converting archived emails zu readable HTML Format",
      "Extracting email templates für Dokumentation",
      "Debugging email rendering Probleme",
      "Testing email client compatibility",
      "Analyzing spam und phishing emails safely",
      "Recovering email content von backups",
      "Converting Outlook PST exports zu HTML",
      "Verarbeitening Thunderbird mbox archives",
      "Extracting marketing email designs",
      "Creating email Dokumentation von templates"
    ],
    "proTips": [
      "Verwenden Raw Anzeigen zu inspect die original MIME structure und debug parsing Probleme",
      "Headers Anzeigen shows authentication Daten (DKIM, SPF) useful für troubleshooting deliverability",
      "Exportieren headers as JSON zu analyze email routing und server hops programmatically",
      "The Tool detects und highlights tracking pixels - useful für privacy analysis",
      "Batch mode lets you process entire folders of archived emails bei once",
      "Aktivieren CSS inlining when exporting templates für better email client compatibility",
      "Verwenden Link Analysis zu extract alle URLs von marketing emails",
      "Template Erkennung identifies common ESP patterns (MailChimp, SendGrid, etc.)",
      "Dark Mode Konvertierung automatically adjusts Farben für dark theme viewing",
      "Download as standalone HTML includes alle inline images as Daten URIs"
    ],
    "troubleshooting": [
      "Ungültig EML Format: Sicherstellen file starts mit email headers und follows RFC822/2822 structure",
      "Encoding Probleme: Versuchen manual charset Auswahl if special characters appear garbled",
      "Missing images: Inline images mit CID references are converted zu Daten URIs, external images may not load",
      "Large file processing: Files over 10MB may be slow - consider splitting oder using batch mode",
      "HTML not rendering: Some emails only contain plain text - prüfen die Rendered Anzeigen tab",
      "Corrupt attachments: Base64 decoding errors indicate corrupted oder non-standard encoding",
      "JavaScript warnings: The Tool automatically removes scripts für security - this is expected behavior",
      "Slow performance: Disable preview rendering für very large HTML emails zu improve speed",
      "Browser compatibility: Verwenden Chrome, Firefox, Safari, oder Edge für full feature support",
      "Missing headers: Some email clients may strip headers - die Tool shows alle available Daten"
    ],
    "keyboardShortcuts": [
      {
        "keys": "Strg+V",
        "description": "Einfügen EML content"
      },
      {
        "keys": "Strg+O",
        "description": "Open file dialog"
      },
      {
        "keys": "Strg+1/2/3/4",
        "description": "Switch anzeigen modes"
      },
      {
        "keys": "Strg+C",
        "description": "Kopieren aktuell anzeigen"
      },
      {
        "keys": "Strg+S",
        "description": "Download HTML"
      },
      {
        "keys": "Strg+E",
        "description": "Exportieren headers JSON"
      }
    ]
  }
}
