{
  "title": "YouTube Timestamp Generator",
  "description": "Erstellen Sie YouTube-Timestamps und Kapitel mit automatischer Link-Generierung und Zeitkonvertierung",
  "placeholder": "00:00",
  "meta": {
    "title": "YouTube Timestamp Generator - Kapitel Kostenlos Erstellen | ToolsLab",
    "description": "Kostenloser YouTube-Timestamp-Generator zum Erstellen von Videokapiteln. Generieren Sie YouTube-fertige Kapitelbeschreibungen mit automatischer Zeitformatierung, klickbaren Links und einfachem Kopieren. Perfekt fuer Content Creator und Video-Editoren."
  },
  "tagline": "Generieren Sie YouTube-Kapitel und Timestamps mit automatischer Link-Erstellung und Zeitkonvertierung",
  "pageDescription": "Professioneller YouTube-Timestamp-Generator fuer Content Creator und Video-Editoren. Erstellen Sie formatierte Timestamps fuer Videobeschreibungen, generieren Sie YouTube-Kapitel fuer verbesserte Navigation und konvertieren Sie sofort zwischen Zeitformaten. Fuegen Sie Timestamps mit Labels hinzu, importieren Sie vorhandene Kapitel und exportieren Sie in mehreren Formaten. Generieren Sie klickbare Timestamp-Links, wenn Sie eine Video-URL angeben. Der integrierte Zeitkonverter verarbeitet HH:MM:SS, MM:SS und Sekundenformate. Die gesamte Verarbeitung erfolgt in Ihrem Browser fuer vollstaendige Privatsphaere - keine Videodaten werden gespeichert oder hochgeladen.",
  "videoUrlPlaceholder": "https://www.youtube.com/watch?v=...",
  "addTimestamp": "Timestamp Hinzufuegen",
  "time": "Zeit",
  "label": "Label",
  "labelPlaceholder": "Kapiteltitel...",
  "timestamps": "Timestamps",
  "noTimestamps": "Noch keine Timestamps. Fuegen Sie den ersten hinzu!",
  "generateChapters": "Kapitel Generieren",
  "importChapters": "Kapitel Importieren",
  "copyChapters": "Kapitel Kopieren",
  "copyLinks": "Mit Links Kopieren",
  "clear": "Alles Loeschen",
  "delete": "Loeschen",
  "edit": "Bearbeiten",
  "save": "Speichern",
  "cancel": "Abbrechen",
  "chaptersFormat": "YouTube Kapitelformat",
  "linksFormat": "Timestamps mit Links",
  "videoUrl": "YouTube Video URL",
  "optional": "(optional)",
  "invalidTime": "Ungueltiges Zeitformat. Verwenden Sie MM:SS oder HH:MM:SS",
  "invalidUrl": "Ungueltige YouTube URL",
  "chaptersOutput": "Kapitel-Ausgabe",
  "linksOutput": "Link-Ausgabe",
  "copied": "Kopiert!",
  "importPlaceholder": "Kapitel hier einfuegen (eines pro Zeile)...\nBeispiel:\n00:00 Einfuehrung\n01:30 Erstes Thema\n05:45 Zweites Thema",
  "importButton": "Importieren",
  "convertTime": "Zeitkonverter",
  "seconds": "Sekunden",
  "formatted": "Formatiert",
  "convert": "Konvertieren",
  "instructions": {
    "title": "So verwenden Sie den YouTube Timestamp Generator",
    "steps": [
      {
        "title": "Fuegen Sie Ihren ersten Timestamp hinzu",
        "description": "Geben Sie eine Zeit im Format MM:SS oder HH:MM:SS ein (z.B. 01:30 oder 1:30:00) und ein beschreibendes Label fuer das Kapitel. Das erste Kapitel bei 00:00 ist erforderlich, damit YouTube-Kapitel funktionieren. Klicken Sie auf 'Timestamp Hinzufuegen' oder druecken Sie Enter, um es zu Ihrer Liste hinzuzufuegen."
      },
      {
        "title": "Erstellen Sie Ihre Kapitelliste",
        "description": "Fuegen Sie weiterhin Timestamps fuer jeden Abschnitt Ihres Videos hinzu. YouTube erfordert mindestens 3 Kapitel, wobei das erste bei 00:00 beginnen muss. Kapitel muessen mindestens 10 Sekunden auseinander liegen. Bearbeiten oder loeschen Sie Timestamps jederzeit mit den Aktionsschaltflaechen in jeder Zeile."
      },
      {
        "title": "Fuegen Sie Ihre Video-URL hinzu (optional)",
        "description": "Fuegen Sie Ihre YouTube-Video-URL ein, um klickbare Timestamp-Links zu generieren. Das Tool unterstuetzt alle YouTube-URL-Formate einschliesslich youtube.com/watch, youtu.be Kurzlinks und Embed-URLs. Links enthalten den &t= Parameter fuer direkte Navigation."
      },
      {
        "title": "Kopieren und verwenden Sie Ihre Kapitel",
        "description": "Klicken Sie auf 'Kapitel Kopieren', um die formatierten Timestamps fuer Ihre Videobeschreibung zu kopieren. Das Format ist genau das, was YouTube erwartet: Timestamp gefolgt vom Titel in jeder Zeile. Wenn Sie eine Video-URL hinzugefuegt haben, verwenden Sie 'Mit Links Kopieren' fuer klickbare Timestamp-Links."
      },
      {
        "title": "Importieren Sie vorhandene Kapitel",
        "description": "Haben Sie Kapitel aus einer anderen Quelle? Klicken Sie auf 'Kapitel Importieren' und fuegen Sie sie im Standardformat ein (Timestamp Leerzeichen Titel). Das Tool analysiert und fuegt sie automatisch zu Ihrer Liste hinzu. Ideal fuer die Migration von Timestamps aus anderen Videos oder Textdateien."
      }
    ],
    "features": [
      "YouTube-Kapitelformat-Ausgabe (fertig fuer Videobeschreibungen)",
      "Automatische Zeitsortierung und -formatierung",
      "Unterstuetzung fuer MM:SS und HH:MM:SS Formate",
      "Klickbare Timestamp-Link-Generierung mit Video-URL",
      "Vorhandene Kapitel aus Text importieren",
      "Timestamps inline bearbeiten ohne Datenverlust",
      "Integrierter Zeitkonverter (Sekunden zu formatiert und umgekehrt)",
      "Ein-Klick-Kopie in die Zwischenablage",
      "Video-ID-Extraktion aus jedem YouTube-URL-Format",
      "Automatische Validierung der YouTube-Kapitelanforderungen",
      "Browserbasierte Verarbeitung - keine Uploads erforderlich",
      "Timestamps mit oder ohne klickbare Links exportieren"
    ],
    "useCases": [
      "Erstellen Sie YouTube-Kapitel fuer verbesserte Video-Navigation und SEO",
      "Generieren Sie Timestamp-Links zum Teilen bestimmter Videomomente",
      "Erstellen Sie Kapitellisten fuer Podcast-Episoden auf YouTube",
      "Erstellen Sie Navigation fuer lange Inhalte (Tutorials, Kurse)",
      "Generieren Sie Timestamps fuer Lernvideoserien",
      "Erstellen Sie Kapitelmarker fuer Livestream-VODs",
      "Erstellen Sie Timestamp-Listen fuer Musikvideos mit mehreren Tracks",
      "Generieren Sie Timestamps fuer Konferenzen und Praesentationen",
      "Erstellen Sie Kapitelnavigation fuer Hoerbuchvideos",
      "Erstellen Sie Timestamp-Listen fuer Compilationvideos"
    ],
    "proTips": [
      "Beginnen Sie immer mit 00:00 - YouTube erfordert, dass das erste Kapitel am Anfang beginnt",
      "Verwenden Sie beschreibende aber praegnante Kapiteltitel (unter 100 Zeichen empfohlen)",
      "Fuegen Sie mindestens 3 Kapitel hinzu - YouTube zeigt Kapitel mit weniger Eintraegen nicht an",
      "Halten Sie Kapitel mindestens 10 Sekunden auseinander, damit YouTube sie erkennt",
      "Fuegen Sie Schluesselthemen in Kapiteltitel fuer bessere Suchsichtbarkeit ein",
      "Verwenden Sie den Zeitkonverter, um schnell die Dauer zwischen Kapiteln zu pruefen",
      "Importieren Sie Kapitel aus Ihrem Skript oder Ihrer Gliederung vor der Aufnahme",
      "Kopieren Sie Kapitel als Backup in eine Textdatei vor der Veroeffentlichung",
      "Verwenden Sie konsistente Benennungskonventionen in Ihrer Videoserie",
      "Fuegen Sie die Video-URL hinzu, um teilbare Timestamp-Links fuer Social Media zu generieren"
    ],
    "troubleshooting": [
      "Kapitel werden auf YouTube nicht angezeigt: Stellen Sie sicher, dass Sie mindestens 3 Kapitel haben, das erste bei 00:00 beginnt und Kapitel mindestens 10 Sekunden auseinander liegen.",
      "Ungueltiger Zeitfehler: Verwenden Sie das Format MM:SS (05:30) oder HH:MM:SS (1:05:30). Reine Sekunden funktionieren auch (90).",
      "Video-URL nicht erkannt: Stellen Sie sicher, dass es eine gueltige YouTube-URL ist. Das Tool unterstuetzt youtube.com/watch, youtu.be und Embed-Formate.",
      "Timestamps nicht in Reihenfolge: Das Tool sortiert Timestamps automatisch chronologisch bei der Ausgabegenerierung.",
      "Import funktioniert nicht: Jedes Kapitel muss in einer eigenen Zeile im Format 'MM:SS Titel' oder 'HH:MM:SS Titel' sein.",
      "Links erscheinen nicht: Fuegen Sie eine gueltige YouTube-Video-URL hinzu, um die Timestamp-Link-Generierung zu aktivieren.",
      "Kapiteltitel abgeschnitten: YouTube kuerzt lange Titel. Halten Sie sie unter 100 Zeichen.",
      "Kopiert aber funktioniert nicht: Stellen Sie sicher, dass Sie in die Videobeschreibung einfuegen, nicht in den Titel oder das Tag-Feld."
    ],
    "keyboardShortcuts": [
      {
        "keys": "Enter",
        "description": "Timestamp hinzufuegen (in Eingabefeldern)"
      },
      {
        "keys": "Strg+C",
        "description": "Kopieren (nach Textauswahl)"
      },
      {
        "keys": "Escape",
        "description": "Bearbeitung abbrechen"
      }
    ]
  }
}
