{
  "title": "Tester API",
  "description": "Testa endpoint API con supporto per vari metodi HTTP e headers",
  "meta": {
    "title": "Tester API - Strumento Online Gratuito | ToolsLab",
    "description": "Testa API REST online. Invia richieste HTTP con headers personalizzati. API tester gratuito."
  },
  "tagline": "Testa API REST con headers personalizzati e request builder",
  "pageDescription": "Strumento professionale per test API per sviluppatori. Invia richieste HTTP con headers, metodi e dati body personalizzati. Testa endpoint RESTful, debug risposte API e valida flussi autenticazione. Supporta metodi GET, POST, PUT, DELETE, PATCH con visualizzazione risposte in tempo reale.",
  "instructions": {
    "title": "Come usare Tester API",
    "steps": [
      {
        "title": "Inserisci l'URL dell'API",
        "description": "Inserisci l'URL dell'endpoint API che vuoi testare. Lo strumento accetta tutti i metodi HTTP standard."
      },
      {
        "title": "Configura le opzioni (se disponibile)",
        "description": "Regola il metodo HTTP, gli headers personalizzati o altri parametri per soddisfare le tue esigenze di test."
      },
      {
        "title": "Esamina la risposta",
        "description": "Lo strumento testerà la tua richiesta e mostrerà la risposta con formattazione e validazione appropriate."
      },
      {
        "title": "Copia o scarica il risultato",
        "description": "Copia la risposta negli appunti per uso immediato o scaricala come file."
      }
    ],
    "features": [
      "Elaborazione in tempo reale con risultati istantanei",
      "Nessun limite di dimensione per l'elaborazione basata su browser",
      "Completamente sicuro - tutta l'elaborazione avviene nel tuo browser",
      "Nessun caricamento dati o archiviazione server",
      "Copia negli appunti con un clic",
      "Scarica i risultati come file",
      "Validazione sintassi ed evidenziazione errori",
      "Funziona offline dopo il caricamento iniziale"
    ],
    "useCases": [
      "Testare endpoint API REST rapidamente",
      "Debug delle risposte API e identificazione errori",
      "Validare flussi di autenticazione e token",
      "Testare diversi metodi HTTP sullo stesso endpoint",
      "Analizzare gli headers di risposta HTTP",
      "Verificare i tempi di risposta delle API",
      "Testare API con headers personalizzati",
      "Validare formati di risposta JSON/XML"
    ],
    "proTips": [
      "Usa le scorciatoie da tastiera per un flusso di lavoro più veloce",
      "Salva le richieste frequenti per riutilizzarle",
      "Controlla gli headers di risposta per diagnosticare problemi",
      "Usa variabili d'ambiente per i token",
      "Testa con payload diversi per validare la robustezza",
      "Verifica attentamente la risposta prima dell'uso in produzione"
    ],
    "troubleshooting": [
      "Errori CORS: verifica la configurazione del server API",
      "Fallimento richiesta: assicurati che l'URL sia valido",
      "Performance lenta: controlla la tua connessione di rete",
      "Errori di autenticazione: valida i tuoi token e headers",
      "Compatibilità browser: usa Chrome, Firefox o Edge per risultati migliori"
    ],
    "keyboardShortcuts": [
      {
        "keys": "Ctrl+V",
        "description": "Incolla input"
      },
      {
        "keys": "Ctrl+Enter",
        "description": "Invia richiesta"
      },
      {
        "keys": "Ctrl+C",
        "description": "Copia risultato"
      },
      {
        "keys": "Ctrl+S",
        "description": "Scarica file"
      }
    ]
  }
}
