{
  "title": "JSON Formatter",
  "description": "Formatta, valida e abbellisce dati JSON con evidenziazione della sintassi",
  "tagline": "Formatta, valida e abbellisci JSON istantaneamente online",
  "pageDescription": "Formatta e valida dati JSON con il nostro formatter JSON online gratuito. Debug di JSON malformato, abbellimento di codice minimizzato e validazione della sintassi con rilevamento errori in tempo reale. Perfetto per sviluppatori che lavorano con API, file di configurazione ed elaborazione dati. Cerca chiavi, personalizza l'indentazione ed elabora file di grandi dimensioni in modo sicuro nel tuo browser.",
  "placeholder": "Incolla qui il tuo JSON...",
  "instructions": {
    "title": "Come usare JSON Formatter",
    "steps": [
      {
        "title": "Incolla il tuo dati JSON",
        "description": "Copia e incolla il tuo dati JSON nell'area di input. Lo strumento accetta qualsiasi formato e lo elaborerà immediatamente."
      },
      {
        "title": "Configura le opzioni (se disponibile)",
        "description": "Regola le opzioni di formattazione, indentazione o altre impostazioni per adattarle alle tue preferenze."
      },
      {
        "title": "Esamina l'output",
        "description": "Lo strumento formatterà ed abbellirà il tuo input e mostrerà il risultato con formattazione e validazione appropriate."
      },
      {
        "title": "Copia o scarica il risultato",
        "description": "Copia il JSON formattato negli appunti per uso immediato o scaricalo come file."
      }
    ],
    "features": [
      "Elaborazione in tempo reale con risultati istantanei",
      "Nessun limite di dimensione per l'elaborazione basata su browser",
      "Completamente sicuro - tutta l'elaborazione avviene nel tuo browser",
      "Nessun caricamento dati o archiviazione server",
      "Copia negli appunti con un clic",
      "Scarica i risultati come file",
      "Validazione sintassi ed evidenziazione errori",
      "Funziona offline dopo il caricamento iniziale"
    ],
    "useCases": [
      "Pulire e formattare codice disordinato per una migliore leggibilità",
      "Standardizzare lo stile del codice nei team di sviluppo",
      "Debug di strutture complesse con indentazione appropriata",
      "Preparare il codice per documentazione e code review",
      "Convertire tra diversi standard di formattazione",
      "Validare la sintassi prima del deploy",
      "Elaborare dati da fonti esterne o API",
      "Generare codice pronto per la produzione"
    ],
    "proTips": [
      "Usa le scorciatoie da tastiera per un flusso di lavoro più veloce",
      "Elabora file di grandi dimensioni in blocchi più piccoli se le prestazioni rallentano",
      "Valida il tuo input prima dell'elaborazione per individuare errori anticipatamente",
      "Salva le impostazioni utilizzate frequentemente come predefinite",
      "Usa la funzione di download per archiviare i file elaborati",
      "Controlla attentamente l'output prima di usarlo in produzione"
    ],
    "troubleshooting": [
      "Errori di sintassi: controlla parentesi, virgolette o punti e virgola mancanti",
      "Elaborazione fallita: assicurati che il formato di input sia valido",
      "Performance lenta: prova a elaborare blocchi di dati più piccoli",
      "Funzionalità mancanti: alcune sintassi avanzate potrebbero richiedere formattazione manuale",
      "Compatibilità browser: usa Chrome, Firefox o Edge per risultati migliori"
    ],
    "keyboardShortcuts": [
      {
        "keys": "Ctrl+V",
        "description": "Incolla input"
      },
      {
        "keys": "Ctrl+Enter",
        "description": "Elabora/Formatta"
      },
      {
        "keys": "Ctrl+C",
        "description": "Copia risultato"
      },
      {
        "keys": "Ctrl+S",
        "description": "Scarica file"
      }
    ]
  },
  "features": [
    "Evidenziazione sintassi",
    "Rilevamento errori",
    "Stampa formattata",
    "Minimizzazione"
  ],
  "meta": {
    "title": "JSON Formatter - Strumento Online Gratuito | ToolsLab",
    "description": "Formatta, valida e abbellisce dati JSON con evidenziazione della sintassi. JSON Formatter online gratuito senza registrazione. Funziona istantaneamente nel browser."
  },
  "labels": {
    "indentSize": "Dimensione rientro",
    "sortKeys": "Ordina chiavi",
    "validateOnly": "Solo validazione"
  },
  "messages": {
    "validJson": "JSON valido",
    "invalidJson": "JSON non valido",
    "formatted": "JSON formattato con successo"
  },
  "options": {
    "compact": "Compatto",
    "expanded": "Espanso"
  }
}
