{
  "title": "Base64 to PDF",
  "description": "Convert Base64 strings to PDF files",
  "placeholder": "",
  "meta": {
    "title": "Base64 to PDF - Free Online Tool",
    "description": "Convert Base64 encoded strings to PDF files online. Decode Base64 data and download as PDF documents instantly. Free, browser-based converter with preview."
  },
  "tagline": "Convert Base64 data to PDF files instantly",
  "pageDescription": "Convert Base64-encoded data to PDF files with instant download. Perfect for developers working with document APIs, email attachments and data processing workflows. Secure browser-based conversion without server uploads. Validate Base64 input, preview PDF metadata and download converted files directly to your device.",
  "instructions": {
    "title": "How to use Base64 to PDF",
    "steps": [
      {
        "title": "Paste your Base64 string or file",
        "description": "Copy and paste your Base64 string or file into the input area. The tool accepts any format and will process it immediately."
      },
      {
        "title": "Configure options (if available)",
        "description": "Adjust formatting options, indentation, or other settings to match your preferences and coding standards."
      },
      {
        "title": "Review the output",
        "description": "The tool will process your input and display the result with proper formatting and validation."
      },
      {
        "title": "Copy or download result",
        "description": "Copy the processed output to your clipboard for immediate use or download it as a file for storage and sharing."
      }
    ],
    "features": [
      "Real-time processing with instant results",
      "No file size limits for browser-based processing",
      "Completely secure - all processing happens in your browser",
      "No data uploads or server storage",
      "Copy to clipboard with one click",
      "Download results as file",
      "Syntax validation and error highlighting",
      "Works offline after initial page load"
    ],
    "useCases": [
      "Clean up and format messy code for better readability",
      "Standardize code style across development teams",
      "Debug complex structures with proper indentation",
      "Prepare code for documentation and code reviews",
      "Convert between different formatting standards",
      "Validate syntax before deployment",
      "Process data from external sources or APIs",
      "Generate production-ready code from development versions"
    ],
    "proTips": [
      "Use keyboard shortcuts for faster workflow",
      "Process large files in smaller chunks if performance slows",
      "Validate your input before processing to catch errors early",
      "Save frequently used settings as defaults in your browser",
      "Use the download feature for archiving processed files",
      "Check the output carefully before using in production"
    ],
    "troubleshooting": [
      "Syntax errors: Check for missing brackets, quotes, or semicolons",
      "Processing fails: Ensure your input format is valid",
      "Slow performance: Try processing smaller chunks of data",
      "Missing features: Some advanced syntax may require manual formatting",
      "Browser compatibility: Use latest version of Chrome, Firefox, or Edge for best results"
    ],
    "keyboardShortcuts": [
      {
        "keys": "Ctrl+V",
        "description": "Paste input"
      },
      {
        "keys": "Ctrl+Enter",
        "description": "Process/Format"
      },
      {
        "keys": "Ctrl+C",
        "description": "Copy result"
      },
      {
        "keys": "Ctrl+S",
        "description": "Download file"
      }
    ]
  }
}
