{
  "title": "Testeur API",
  "description": "Testez les endpoints API avec support pour différentes méthodes HTTP et en-têtes",
  "placeholder": "Entrez l'URL de l'API...",
  "meta": {
    "title": "Testeur API - Outil en Ligne Gratuit | ToolsLab",
    "description": "Testez les API REST en ligne. Envoyez des requêtes HTTP avec en-têtes personnalisés. Testeur API gratuit."
  },
  "tagline": "Testez les API REST avec en-têtes personnalisés et constructeur de requêtes",
  "pageDescription": "Outil professionnel de test API pour développeurs. Envoyez des requêtes HTTP avec en-têtes, méthodes et données body personnalisés. Testez les endpoints RESTful, déboguez les réponses API et validez les flux d'authentification. Supporte les méthodes GET, POST, PUT, DELETE, PATCH avec visualisation des réponses en temps réel.",
  "instructions": {
    "title": "Comment utiliser Testeur API",
    "steps": [
      {
        "title": "Saisissez l'URL de l'API",
        "description": "Entrez l'URL de l'endpoint API que vous souhaitez tester. L'outil accepte toutes les méthodes HTTP standards."
      },
      {
        "title": "Configurez les options (si disponible)",
        "description": "Ajustez la méthode HTTP, les en-têtes personnalisés ou d'autres paramètres pour correspondre à vos besoins de test."
      },
      {
        "title": "Examinez la réponse",
        "description": "L'outil va tester votre requête et afficher la réponse avec formatage et validation appropriés."
      },
      {
        "title": "Copiez ou téléchargez le résultat",
        "description": "Copiez la réponse dans votre presse-papiers pour utilisation immédiate ou téléchargez-la en tant que fichier."
      }
    ],
    "features": [
      "Traitement en temps réel avec résultats instantanés",
      "Aucune limite de taille pour le traitement basé sur navigateur",
      "Complètement sécurisé - tout le traitement se fait dans votre navigateur",
      "Aucun téléchargement de données ou stockage serveur",
      "Copier dans le presse-papiers en un clic",
      "Télécharger les résultats sous forme de fichier",
      "Validation de syntaxe et mise en évidence des erreurs",
      "Fonctionne hors ligne après le chargement initial"
    ],
    "useCases": [
      "Tester les endpoints API REST rapidement",
      "Déboguer les réponses API et identifier les erreurs",
      "Valider les flux d'authentification et les tokens",
      "Tester différentes méthodes HTTP sur le même endpoint",
      "Analyser les en-têtes de réponse HTTP",
      "Vérifier les temps de réponse des API",
      "Tester les API avec en-têtes personnalisés",
      "Valider les formats de réponse JSON/XML"
    ],
    "proTips": [
      "Utilisez les raccourcis clavier pour un flux de travail plus rapide",
      "Sauvegardez les requêtes fréquentes pour les réutiliser",
      "Vérifiez les en-têtes de réponse pour diagnostiquer les problèmes",
      "Utilisez des variables d'environnement pour les tokens",
      "Testez avec différents payloads pour valider la robustesse",
      "Vérifiez attentivement la réponse avant utilisation en production"
    ],
    "troubleshooting": [
      "Erreurs CORS : vérifiez la configuration du serveur API",
      "Échec de requête : assurez-vous que l'URL est valide",
      "Performance lente : vérifiez votre connexion réseau",
      "Erreurs d'authentification : validez vos tokens et en-têtes",
      "Compatibilité navigateur : utilisez Chrome, Firefox ou Edge pour de meilleurs résultats"
    ],
    "keyboardShortcuts": [
      {
        "keys": "Ctrl+V",
        "description": "Coller l'entrée"
      },
      {
        "keys": "Ctrl+Enter",
        "description": "Envoyer la requête"
      },
      {
        "keys": "Ctrl+C",
        "description": "Copier le résultat"
      },
      {
        "keys": "Ctrl+S",
        "description": "Télécharger le fichier"
      }
    ]
  }
}
