{
  "title": "Formateur JSON",
  "description": "Formatez, validez et embellissez les données JSON avec coloration syntaxique",
  "placeholder": "Collez votre JSON ici...",
  "instructions": {
    "title": "Comment utiliser Formateur JSON",
    "steps": [
      {
        "title": "Collez vos données JSON",
        "description": "Copiez et collez vos données JSON dans la zone de saisie. L'outil accepte tout format et le traitera immédiatement."
      },
      {
        "title": "Configurez les options (si disponible)",
        "description": "Ajustez les options de formatage, l'indentation ou d'autres paramètres pour correspondre à vos préférences."
      },
      {
        "title": "Examinez la sortie",
        "description": "L'outil va formater et embellir votre saisie et afficher le résultat avec formatage et validation appropriés."
      },
      {
        "title": "Copiez ou téléchargez le résultat",
        "description": "Copiez le JSON formaté dans votre presse-papiers pour utilisation immédiate ou téléchargez-le en tant que fichier."
      }
    ],
    "features": [
      "Traitement en temps réel avec résultats instantanés",
      "Aucune limite de taille pour le traitement basé sur navigateur",
      "Complètement sécurisé - tout le traitement se fait dans votre navigateur",
      "Aucun téléchargement de données ou stockage serveur",
      "Copier dans le presse-papiers en un clic",
      "Télécharger les résultats sous forme de fichier",
      "Validation de syntaxe et mise en évidence des erreurs",
      "Fonctionne hors ligne après le chargement initial"
    ],
    "useCases": [
      "Nettoyer et formater le JSON désordonné pour une meilleure lisibilité",
      "Standardiser le style de code dans les équipes de développement",
      "Déboguer les structures complexes avec une indentation appropriée",
      "Préparer le code pour la documentation et les revues de code",
      "Convertir entre différents standards de formatage",
      "Valider la syntaxe avant le déploiement",
      "Traiter les données provenant de sources externes ou d'API",
      "Générer du code prêt pour la production"
    ],
    "proTips": [
      "Utilisez les raccourcis clavier pour un flux de travail plus rapide",
      "Traitez les gros fichiers en petits morceaux si les performances ralentissent",
      "Validez votre saisie avant le traitement pour détecter les erreurs tôt",
      "Enregistrez les paramètres fréquemment utilisés par défaut",
      "Utilisez la fonction de téléchargement pour archiver les fichiers",
      "Vérifiez attentivement la sortie avant utilisation en production"
    ],
    "troubleshooting": [
      "Erreurs de syntaxe : vérifiez les crochets, guillemets ou points-virgules manquants",
      "Échec de traitement : assurez-vous que le format de saisie est valide",
      "Performance lente : essayez de traiter de plus petits morceaux de données",
      "Fonctionnalités manquantes : certaines syntaxes avancées peuvent nécessiter un formatage manuel",
      "Compatibilité navigateur : utilisez Chrome, Firefox ou Edge pour de meilleurs résultats"
    ],
    "keyboardShortcuts": [
      {
        "keys": "Ctrl+V",
        "description": "Coller l'entrée"
      },
      {
        "keys": "Ctrl+Enter",
        "description": "Traiter/Formater"
      },
      {
        "keys": "Ctrl+C",
        "description": "Copier le résultat"
      },
      {
        "keys": "Ctrl+S",
        "description": "Télécharger le fichier"
      }
    ]
  },
  "features": [
    "Coloration syntaxique",
    "Détection d'erreurs",
    "Impression formatée",
    "Minification"
  ],
  "meta": {
    "title": "Formateur JSON - Outil en Ligne Gratuit | ToolsLab",
    "description": "Formatez, validez et embellissez les données JSON avec coloration syntaxique. Formateur JSON en ligne gratuit sans inscription requise. Fonctionne instantanément dans votre navigateur."
  },
  "labels": {
    "indentSize": "Taille d'Indentation",
    "sortKeys": "Trier les Clés",
    "validateOnly": "Valider Uniquement"
  },
  "messages": {
    "validJson": "JSON Valide",
    "invalidJson": "JSON Invalide",
    "formatted": "JSON formaté avec succès"
  },
  "options": {
    "compact": "Compact",
    "expanded": "Étendu"
  },
  "tagline": "Format, validate and beautify JSON instantly online",
  "pageDescription": "Format and validate JSON data with our free online JSON formatter. Debug malformed JSON, beautify minified code, and validate syntax with real-time error detection. Perfect for developers working with APIs, config files, and data processing. Search keys, customize indentation, and process large files securely in your browser."
}
