{
  "title": "Generador de Timestamps YouTube",
  "description": "Crea timestamps y capitulos de YouTube con generacion automatica de enlaces y conversion de tiempo",
  "placeholder": "00:00",
  "meta": {
    "title": "Generador de Timestamps YouTube - Crea Capitulos Gratis | ToolsLab",
    "description": "Generador de timestamps de YouTube gratuito para crear capitulos de video. Genera descripciones de capitulos listas para YouTube con formato de tiempo automatico, enlaces clicables y copia-pega facil. Perfecto para creadores de contenido y editores de video."
  },
  "tagline": "Genera capitulos y timestamps de YouTube con creacion automatica de enlaces y conversion de tiempo",
  "pageDescription": "Generador profesional de timestamps de YouTube para creadores de contenido y editores de video. Crea timestamps formateados para descripciones de video, genera Capitulos de YouTube para navegacion mejorada y convierte entre formatos de tiempo instantaneamente. Agrega timestamps con etiquetas, importa capitulos existentes y exporta en multiples formatos. Genera enlaces de timestamp clicables cuando proporcionas una URL de video. El convertidor de tiempo integrado maneja formatos HH:MM:SS, MM:SS y segundos. Todo el procesamiento ocurre en tu navegador para privacidad completa - ningun dato de video se almacena o sube.",
  "videoUrlPlaceholder": "https://www.youtube.com/watch?v=...",
  "addTimestamp": "Agregar Timestamp",
  "time": "Tiempo",
  "label": "Etiqueta",
  "labelPlaceholder": "Titulo del capitulo...",
  "timestamps": "Timestamps",
  "noTimestamps": "Sin timestamps aun. Agrega el primero!",
  "generateChapters": "Generar Capitulos",
  "importChapters": "Importar Capitulos",
  "copyChapters": "Copiar Capitulos",
  "copyLinks": "Copiar con Enlaces",
  "clear": "Limpiar Todo",
  "delete": "Eliminar",
  "edit": "Editar",
  "save": "Guardar",
  "cancel": "Cancelar",
  "chaptersFormat": "Formato Capitulos YouTube",
  "linksFormat": "Timestamps con Enlaces",
  "videoUrl": "URL Video YouTube",
  "optional": "(opcional)",
  "invalidTime": "Formato de tiempo invalido. Usa MM:SS o HH:MM:SS",
  "invalidUrl": "URL de YouTube invalida",
  "chaptersOutput": "Salida de Capitulos",
  "linksOutput": "Salida de Enlaces",
  "copied": "Copiado!",
  "importPlaceholder": "Pega los capitulos aqui (uno por linea)...\nEjemplo:\n00:00 Introduccion\n01:30 Primer Tema\n05:45 Segundo Tema",
  "importButton": "Importar",
  "convertTime": "Convertidor de Tiempo",
  "seconds": "Segundos",
  "formatted": "Formateado",
  "convert": "Convertir",
  "instructions": {
    "title": "Como usar el Generador de Timestamps YouTube",
    "steps": [
      {
        "title": "Agrega tu primer timestamp",
        "description": "Ingresa un tiempo en formato MM:SS o HH:MM:SS (ej. 01:30 o 1:30:00) y una etiqueta descriptiva para el capitulo. El primer capitulo en 00:00 es requerido para que funcionen los Capitulos de YouTube. Haz clic en 'Agregar Timestamp' o presiona Enter para agregarlo a tu lista."
      },
      {
        "title": "Construye tu lista de capitulos",
        "description": "Continua agregando timestamps para cada seccion de tu video. YouTube requiere al menos 3 capitulos con el primero comenzando en 00:00. Los capitulos deben estar separados por al menos 10 segundos. Edita o elimina timestamps en cualquier momento usando los botones de accion en cada fila."
      },
      {
        "title": "Agrega la URL de tu video (opcional)",
        "description": "Pega la URL de tu video de YouTube para generar enlaces de timestamp clicables. La herramienta soporta todos los formatos de URL de YouTube incluyendo youtube.com/watch, enlaces cortos youtu.be y URLs embed. Los enlaces incluiran el parametro &t= para navegacion directa."
      },
      {
        "title": "Copia y usa tus capitulos",
        "description": "Haz clic en 'Copiar Capitulos' para copiar los timestamps formateados para la descripcion de tu video. El formato es exactamente lo que YouTube espera: timestamp seguido del titulo en cada linea. Si agregaste una URL de video, usa 'Copiar con Enlaces' para enlaces de timestamp clicables."
      },
      {
        "title": "Importa capitulos existentes",
        "description": "Tienes capitulos de otra fuente? Haz clic en 'Importar Capitulos' y pegalos en el formato estandar (timestamp espacio titulo). La herramienta los analizara y agregara a tu lista automaticamente. Genial para migrar timestamps de otros videos o archivos de texto."
      }
    ],
    "features": [
      "Salida en formato Capitulos YouTube (listo para descripciones de video)",
      "Ordenamiento y formato automatico del tiempo",
      "Soporte para formatos MM:SS y HH:MM:SS",
      "Generacion de enlaces de timestamp clicables con URL de video",
      "Importar capitulos existentes desde texto",
      "Editar timestamps en linea sin perder datos",
      "Convertidor de tiempo integrado (segundos a formateado y viceversa)",
      "Copiar al portapapeles con un clic",
      "Extraccion de ID de video de cualquier formato de URL de YouTube",
      "Validacion automatica de requisitos de Capitulos YouTube",
      "Procesamiento en navegador - sin subidas necesarias",
      "Exportar timestamps con o sin enlaces clicables"
    ],
    "useCases": [
      "Crea Capitulos de YouTube para navegacion de video y SEO mejorados",
      "Genera enlaces de timestamp para compartir momentos especificos del video",
      "Construye listas de capitulos para episodios de podcast en YouTube",
      "Crea navegacion para contenido largo (tutoriales, cursos)",
      "Genera timestamps para series de videos educativos",
      "Crea marcadores de capitulo para VODs de transmisiones en vivo",
      "Construye listas de timestamps para videos musicales con multiples pistas",
      "Genera timestamps para conferencias y presentaciones",
      "Crea navegacion de capitulos para videos de audiolibros",
      "Construye listas de timestamps para videos de compilaciones"
    ],
    "proTips": [
      "Siempre comienza con 00:00 - YouTube requiere que el primer capitulo comience al inicio",
      "Usa titulos de capitulo descriptivos pero concisos (menos de 100 caracteres recomendado)",
      "Agrega al menos 3 capitulos - YouTube no mostrara capitulos con menos entradas",
      "Mantiene los capitulos separados por al menos 10 segundos para que YouTube los reconozca",
      "Incluye temas clave en los titulos de capitulos para mejor visibilidad en busquedas",
      "Usa el convertidor de tiempo para verificar rapidamente la duracion entre capitulos",
      "Importa capitulos de tu guion o esquema antes de grabar",
      "Copia los capitulos a un archivo de texto como respaldo antes de publicar",
      "Usa convenciones de nombres consistentes en tu serie de videos",
      "Agrega la URL del video para generar enlaces de timestamp compartibles en redes sociales"
    ],
    "troubleshooting": [
      "Capitulos no se muestran en YouTube: Asegurate de tener al menos 3 capitulos, el primero comienza en 00:00 y los capitulos estan separados por al menos 10 segundos.",
      "Error de tiempo invalido: Usa formato MM:SS (05:30) o HH:MM:SS (1:05:30). Los segundos puros tambien funcionan (90).",
      "URL de video no reconocida: Asegurate de que sea una URL de YouTube valida. La herramienta soporta youtube.com/watch, youtu.be y formatos embed.",
      "Timestamps no en orden: La herramienta ordena automaticamente los timestamps cronologicamente al generar la salida.",
      "Importacion no funciona: Cada capitulo debe estar en su propia linea con formato 'MM:SS Titulo' o 'HH:MM:SS Titulo'.",
      "Enlaces no aparecen: Agrega una URL de video de YouTube valida para habilitar la generacion de enlaces de timestamp.",
      "Titulos de capitulo cortados: YouTube trunca titulos largos. Mantenlos bajo 100 caracteres.",
      "Copiado pero no funciona: Asegurate de pegar en la descripcion del video, no en el titulo o campo de etiquetas."
    ],
    "keyboardShortcuts": [
      {
        "keys": "Enter",
        "description": "Agregar timestamp (cuando esta en campos de entrada)"
      },
      {
        "keys": "Ctrl+C",
        "description": "Copiar (despues de seleccionar texto)"
      },
      {
        "keys": "Escape",
        "description": "Cancelar edicion"
      }
    ]
  }
}
